agamalel/TM4C12x/4C123/Temperature Sensor/SSI_Nokia5110.c

#include "tm4c123gh6pm.h"
#include "SSI_Nokia5110.h"

// This table contains the hex values that represent pixels
// for a font that is 5 pixels wide and 8 pixels high
static const char ASCII[][5] = {
  {0x00, 0x00, 0x00, 0x00, 0x00} // 20
  ,{0x00, 0x00, 0x5f, 0x00, 0x00} // 21 !
  ,{0x00, 0x07, 0x00, 0x07, 0x00} // 22 "
  ,{0x14, 0x7f, 0x14, 0x7f, 0x14} // 23 #
  ,{0x24, 0x2a, 0x7f, 0x2a, 0x12} // 24 $
  ,{0x23, 0x13, 0x08, 0x64, 0x62} // 25 %
  ,{0x36, 0x49, 0x55, 0x22, 0x50} // 26 &
  ,{0x00, 0x05, 0x03, 0x00, 0x00} // 27 '
  ,{0x00, 0x1c, 0x22, 0x41, 0x00} // 28 (
  ,{0x00, 0x41, 0x22, 0x1c, 0x00} // 29 )
  ,{0x14, 0x08, 0x3e, 0x08, 0x14} // 2a *
  ,{0x08, 0x08, 0x3e, 0x08, 0x08} // 2b +
  ,{0x00, 0x50, 0x30, 0x00, 0x00} // 2c ,
  ,{0x08, 0x08, 0x08, 0x08, 0x08} // 2d -
  ,{0x00, 0x60, 0x60, 0x00, 0x00} // 2e .
  ,{0x20, 0x10, 0x08, 0x04, 0x02} // 2f /
  ,{0x3e, 0x51, 0x49, 0x45, 0x3e} // 30 0
  ,{0x00, 0x42, 0x7f, 0x40, 0x00} // 31 1
  ,{0x42, 0x61, 0x51, 0x49, 0x46} // 32 2
  ,{0x21, 0x41, 0x45, 0x4b, 0x31} // 33 3
  ,{0x18, 0x14, 0x12, 0x7f, 0x10} // 34 4
  ,{0x27, 0x45, 0x45, 0x45, 0x39} // 35 5
  ,{0x3c, 0x4a, 0x49, 0x49, 0x30} // 36 6
  ,{0x01, 0x71, 0x09, 0x05, 0x03} // 37 7
  ,{0x36, 0x49, 0x49, 0x49, 0x36} // 38 8
  ,{0x06, 0x49, 0x49, 0x29, 0x1e} // 39 9
  ,{0x00, 0x36, 0x36, 0x00, 0x00} // 3a :
  ,{0x00, 0x56, 0x36, 0x00, 0x00} // 3b ;
  ,{0x08, 0x14, 0x22, 0x41, 0x00} // 3c <
  ,{0x14, 0x14, 0x14, 0x14, 0x14} // 3d =
  ,{0x00, 0x41, 0x22, 0x14, 0x08} // 3e >
  ,{0x02, 0x01, 0x51, 0x09, 0x06} // 3f ?
  ,{0x32, 0x49, 0x79, 0x41, 0x3e} // 40 @
  ,{0x7e, 0x11, 0x11, 0x11, 0x7e} // 41 A
  ,{0x7f, 0x49, 0x49, 0x49, 0x36} // 42 B
  ,{0x3e, 0x41, 0x41, 0x41, 0x22} // 43 C
  ,{0x7f, 0x41, 0x41, 0x22, 0x1c} // 44 D
  ,{0x7f, 0x49, 0x49, 0x49, 0x41} // 45 E
  ,{0x7f, 0x09, 0x09, 0x09, 0x01} // 46 F
  ,{0x3e, 0x41, 0x49, 0x49, 0x7a} // 47 G
  ,{0x7f, 0x08, 0x08, 0x08, 0x7f} // 48 H
  ,{0x00, 0x41, 0x7f, 0x41, 0x00} // 49 I
  ,{0x20, 0x40, 0x41, 0x3f, 0x01} // 4a J
  ,{0x7f, 0x08, 0x14, 0x22, 0x41} // 4b K
  ,{0x7f, 0x40, 0x40, 0x40, 0x40} // 4c L
  ,{0x7f, 0x02, 0x0c, 0x02, 0x7f} // 4d M
  ,{0x7f, 0x04, 0x08, 0x10, 0x7f} // 4e N
  ,{0x3e, 0x41, 0x41, 0x41, 0x3e} // 4f O
  ,{0x7f, 0x09, 0x09, 0x09, 0x06} // 50 P
  ,{0x3e, 0x41, 0x51, 0x21, 0x5e} // 51 Q
  ,{0x7f, 0x09, 0x19, 0x29, 0x46} // 52 R
  ,{0x46, 0x49, 0x49, 0x49, 0x31} // 53 S
  ,{0x01, 0x01, 0x7f, 0x01, 0x01} // 54 T
  ,{0x3f, 0x40, 0x40, 0x40, 0x3f} // 55 U
  ,{0x1f, 0x20, 0x40, 0x20, 0x1f} // 56 V
  ,{0x3f, 0x40, 0x38, 0x40, 0x3f} // 57 W
  ,{0x63, 0x14, 0x08, 0x14, 0x63} // 58 X
  ,{0x07, 0x08, 0x70, 0x08, 0x07} // 59 Y
  ,{0x61, 0x51, 0x49, 0x45, 0x43} // 5a Z
  ,{0x00, 0x7f, 0x41, 0x41, 0x00} // 5b [
  ,{0x02, 0x04, 0x08, 0x10, 0x20} // 5c '\'
  ,{0x00, 0x41, 0x41, 0x7f, 0x00} // 5d ]
  ,{0x04, 0x02, 0x01, 0x02, 0x04} // 5e ^
  ,{0x40, 0x40, 0x40, 0x40, 0x40} // 5f _
  ,{0x00, 0x01, 0x02, 0x04, 0x00} // 60 `
  ,{0x20, 0x54, 0x54, 0x54, 0x78} // 61 a
  ,{0x7f, 0x48, 0x44, 0x44, 0x38} // 62 b
  ,{0x38, 0x44, 0x44, 0x44, 0x20} // 63 c
  ,{0x38, 0x44, 0x44, 0x48, 0x7f} // 64 d
  ,{0x38, 0x54, 0x54, 0x54, 0x18} // 65 e
  ,{0x08, 0x7e, 0x09, 0x01, 0x02} // 66 f
  ,{0x0c, 0x52, 0x52, 0x52, 0x3e} // 67 g
  ,{0x7f, 0x08, 0x04, 0x04, 0x78} // 68 h
  ,{0x00, 0x44, 0x7d, 0x40, 0x00} // 69 i
  ,{0x20, 0x40, 0x44, 0x3d, 0x00} // 6a j
  ,{0x7f, 0x10, 0x28, 0x44, 0x00} // 6b k
  ,{0x00, 0x41, 0x7f, 0x40, 0x00} // 6c l
  ,{0x7c, 0x04, 0x18, 0x04, 0x78} // 6d m
  ,{0x7c, 0x08, 0x04, 0x04, 0x78} // 6e n
  ,{0x38, 0x44, 0x44, 0x44, 0x38} // 6f o
  ,{0x7c, 0x14, 0x14, 0x14, 0x08} // 70 p
  ,{0x08, 0x14, 0x14, 0x18, 0x7c} // 71 q
  ,{0x7c, 0x08, 0x04, 0x04, 0x08} // 72 r
  ,{0x48, 0x54, 0x54, 0x54, 0x20} // 73 s
  ,{0x04, 0x3f, 0x44, 0x40, 0x20} // 74 t
  ,{0x3c, 0x40, 0x40, 0x20, 0x7c} // 75 u
  ,{0x1c, 0x20, 0x40, 0x20, 0x1c} // 76 v
  ,{0x3c, 0x40, 0x30, 0x40, 0x3c} // 77 w
  ,{0x44, 0x28, 0x10, 0x28, 0x44} // 78 x
  ,{0x0c, 0x50, 0x50, 0x50, 0x3c} // 79 y
  ,{0x44, 0x64, 0x54, 0x4c, 0x44} // 7a z
  ,{0x00, 0x08, 0x36, 0x41, 0x00} // 7b {
  ,{0x00, 0x00, 0x7f, 0x00, 0x00} // 7c |
  ,{0x00, 0x41, 0x36, 0x08, 0x00} // 7d }
  ,{0x10, 0x08, 0x08, 0x10, 0x08} // 7e ~
//  ,{0x78, 0x46, 0x41, 0x46, 0x78} // 7f DEL
  ,{0x1f, 0x24, 0x7c, 0x24, 0x1f} // 7f UT sign
};

#define RES   						(*( (volatile unsigned long *) 0x40004200 )) // PA7
#define DC    						(*( (volatile unsigned long *) 0x40004100 )) // PA6
#define BSY								0x00000010 // Busy bit
#define TNF								0x00000002
#define NO_OF_PIXELS			( ( 84 * 48) / 8 )
#define MAX_X             84
#define MAX_Y             48
#define DC_COMMAND				0
#define DC_DATA						0x40

unsigned char String[10];

void Init_SSI(void)
{
	volatile unsigned long delay;
// PortA initialization
	SYSCTL_RCGC2_R|= SYSCTL_RCGC2_GPIOA;
	delay= SYSCTL_RCGC2_R;
	GPIO_PORTA_AMSEL_R&= 0x00;
  GPIO_PORTA_AFSEL_R|= 0x2C; // PA2-PA5 SSI
	GPIO_PORTA_PCTL_R= (GPIO_PORTA_PCTL_R & ~0x00FFFF00) + 0x00222200;
	GPIO_PORTA_DEN_R|= 0xEC;
	GPIO_PORTA_DIR_R= (GPIO_PORTA_DIR_R & ~0x30) + 0xE0; // PA6, PA7 output, PA4 recieve, PA5 Transmit
// SSI Initialization
	SYSCTL_RCGC1_R|= SYSCTL_RCGC1_SSI0; // Enable clock for SSI0
	delay= SYSCTL_RCGCSSI_R;
	SSI0_CR1_R&= ~0x02; // Disable SSI during configuration
	SSI0_CR1_R&= 0; // Master mode
	SSI0_CC_R&= 0; // SSICLK source is the SYSCLCK
	// configure Baud Rate bits to 4 MHz
	SSI0_CPSR_R= 2; // CPSDVSR = 2
  SSI0_CR0_R= 0x0900; // SCR = 9 for 4 MHz SSI Baud Rate
	SSI0_CR0_R|= 0x0007; // 8-bit data size
	SSI0_CR0_R&= ~0x00F0; // Freescale SPI, SPO = SPH = 0
	SSI0_CR1_R|= 0x02; // Enable the SSI
}

void Init_Nokia5110(void)
{
	unsigned long delay;

	Init_SSI();
	RES= 0; // reset LCD to a known state
	for(delay= 10; 0 != delay; --delay) {}; // about 100ns delay (Minimum)
	RES= 0x80; // negative logic
  Nokia5110_Write(command, 0x21);  // chip active PD = 0, V = 0 (horizontal addressing mode), H = 1 (extended instruction set)
	Nokia5110_Write(command, 0xB1);  // 3.3 Volt red SparkFun
  Nokia5110_Write(command, 0x04);  // set temp Coefficient
	Nokia5110_Write(command, 0x14);  // set 1:48 Bias	 		
	Nokia5110_Write(command, 0x20);  // we must send 0x20 before change the display control mode
  Nokia5110_Write(command, 0x0C);  // Normal Mode	
	Nokia5110_Clear();
}


void Nokia5110_Write(enum writetype type, unsigned char byte)
{
	if(command == type)
	{
		while( BSY == (SSI0_SR_R & BSY) ) {}; 
		DC= DC_COMMAND;
		SSI0_DR_R= byte;
		while( BSY == (SSI0_SR_R & BSY) ) {}; 
	}
	else
	{
		while( !TNF == (SSI0_SR_R & TNF) ) {}; // wait until transmit FIFO have a place
		DC= DC_DATA;
		SSI0_DR_R= byte;
	}
}	

void Nokia5110_SetCursor(unsigned long X, unsigned long Y)
{
	if(X > 11 || Y > 5) {   // if bad input
		return;
	}
	else
	{
		Nokia5110_Write(command, (X | 0x80)); // Set DB7
		Nokia5110_Write(command, (Y | 0x40)); // Set DB6
	}
}

void Nokia5110_OutChar(unsigned char Ch)
{
	long i;
	
	Nokia5110_Write(data, 0x00); // leave a blank column
	for(i= 0; i < 5; ++i) {
		Nokia5110_Write(data, ASCII[Ch - 0x20][i]);
	}
	Nokia5110_Write(data, 0x00);
}

void Nokia5110_Clear(void)
{
	long i;
// Write 0s in all pixels
	for(i= 0; i < NO_OF_PIXELS; ++i) {
		Nokia5110_Write(data, 0x00); 
	}
	Nokia5110_SetCursor(0, 0); // reset the Cursor
}

void Nokia5110_OutString(unsigned char *pSTR)
{
	while(*pSTR) 
	{
		Nokia5110_OutChar((unsigned char)*pSTR);
	  ++pSTR;
	}
}

void Nokia5110_DrawImage(unsigned char *pSTR)
{
	long i;
	
	Nokia5110_SetCursor(0, 0);
	for(i= 0; i < NO_OF_PIXELS; ++i) {
		Nokia5110_Write(data, pSTR[i]);
	}
}

void ConvertU_TODistance(unsigned long temp)
{
	signed char i;

	for(i= 4; i > -1; --i)
	{
		if(temp < 10000)
		{
			if(1 != i )
			{
				String[i]= temp % 10;
				String[i]|= 0x30;
				temp/= 10;
			}
			else {
				String[i]= '.';
			}
		}
		else
		{
			if(1 != i)
				String[i]= '*';
			else
				String[i]= '.';
		}
	}
	i= 5;
	String[i++]= ' ';
	String[i++]= 'c';
	String[i++]= 'm';
}

//********Nokia5110_OutUDec*****************
// Output a 16-bit number in unsigned decimal format with a
// fixed size of five right-justified digits of output.
// Inputs: n  16-bit unsigned number
// Outputs: none
// assumes: LCD is in default horizontal addressing mode (V = 0)
void Nokia5110_OutUDec(unsigned short n){
  if(n < 10){
    Nokia5110_OutString("   ");
    Nokia5110_OutChar(n+'0'); /* n is between 0 and 9 */
  } else if(n<100){
    Nokia5110_OutString("   ");
    Nokia5110_OutChar(n/10+'0'); /* tens digit */
    Nokia5110_OutChar(n%10+'0'); /* ones digit */
  } else if(n<1000){
    Nokia5110_OutString("  ");
    Nokia5110_OutChar(n/100+'0'); /* hundreds digit */
    n = n%100;
    Nokia5110_OutChar(n/10+'0'); /* tens digit */
    Nokia5110_OutChar(n%10+'0'); /* ones digit */
  }
  else if(n<10000){
    Nokia5110_OutChar(' ');
    Nokia5110_OutChar(n/1000+'0'); /* thousands digit */
    n = n%1000;
    Nokia5110_OutChar(n/100+'0'); /* hundreds digit */
    n = n%100;
    Nokia5110_OutChar(n/10+'0'); /* tens digit */
    Nokia5110_OutChar(n%10+'0'); /* ones digit */
  }
  else {
    Nokia5110_OutChar(n/10000+'0'); /* ten-thousands digit */
    n = n%10000;
    Nokia5110_OutChar(n/1000+'0'); /* thousands digit */
    n = n%1000;
    Nokia5110_OutChar(n/100+'0'); /* hundreds digit */
    n = n%100;
    Nokia5110_OutChar(n/10+'0'); /* tens digit */
    Nokia5110_OutChar(n%10+'0'); /* ones digit */
  }
}

